<a href="https://colab.research.google.com/github/wiramonwrm/data-analytics/blob/main/R_cheat_sheet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Basic calculation in R

1+1
2-5
5*2
5/2
5**2
5%%2

[1] 2

[1] -3

[1] 10

[1] 2.5

[1] 25

[1] 1

In [16]:
## Variables

# assign variables
income = 5000
expense <- 2000
saving <- income - expense
name = "John"
is_human = TRUE
today_date = as.Date("2024-07-02")

In [14]:
saving

[1] 3000

In [15]:
# remove vairables
rm(saving)

In [18]:
# check data types
class(expense)
class(name)
class(is_human)
class(today_date)

[1] "numeric"

[1] "character"

[1] "logical"

[1] "Date"

In [21]:
# change data tpyes
age = "35"
class(age)
age = as.numeric(age)
class(age)

[1] "character"

[1] "numeric"

In [29]:
## Data Structures

# 1. vector

friends = c("James", "Mary", "Alex", "Joe", "Jane")
ages = c(30,31,32,33,34)
own_a_pet =c(T, F, F, T, T)
city = c("London","Munich","Paris","Bangkok","Berlin")

In [31]:
# 2. matrix - 2D vector

m1 = matrix(1:4, ncol=2)

m2 = matrix(c(5,5,2,1), ncol=2)

In [30]:
# 3. List

# key-value data structure
John = list(
  first_name = "John",
  last_name = "Wick",
  age = 50,
  country = "USA",
  salary = 10000,
  marvel_fan = TRUE,
  marvel_movies = c("Thor", "Loki", "Iron Man")
)

Mary = list(
  first_name = "Mary",
  last_name = "Wick",
  age = 60,
  country = "Germany",
  salary = 12000,
  marvel_fan = TRUE,
  marvel_movies = c("Thor2", "Loki2", "Iron Man2")
)

# nested list
customers = list(
                id_01 = John,
                id_02 = Mary)

In [47]:
# 4. data Frame

# create a data frame

id = 1:5
df = data.frame(id, friends, ages, own_a_pet, city)

# create new column

df$fav_menu = c("Brezel", "Steak", "Pizza", "Pizza", "Sushi")

# remove column

df$fav_menu = NULL

# write csv file

write.csv(df, "result.csv", row.names = F)

# read csv file

df = read.csv("result.csv")

In [40]:
# query by position

df[1:2]

  id friends
1 1  James
2 2  Mary
3 3  Alex
4 4  Joe
5 5  Jane

In [43]:
# query by name
df$own_a_pet

[1]  TRUE FALSE FALSE  TRUE  TRUE

In [44]:
# query by condition

df[ df$own_a_pet == TRUE ]

  id own_a_pet city
1 1   TRUE     London
2 2  FALSE     Munich
3 3  FALSE     Paris
4 4   TRUE     Bangkok
5 5   TRUE     Berlin

In [48]:
# create a function

greeting_name = function(name) {
    text = paste0("Hello ", name)
    print(text)
}

In [49]:
greeting_name("John")

[1] "Hello John"

In [52]:
add_to_num = function(x=10,y=20) {
  return(x+y)
}

In [50]:
cube = function(base,power=3) {
  base**power #return is not needed
}

In [51]:
cube2 = function(base,power=3) base**power

In [53]:
cube(5) == cube2(5)

[1] TRUE

In [54]:
## Control flow
# if

ifelse(10>2, T,F)

[1] TRUE

In [55]:
score = 180

if(score >= 200) {
  print("passed")
} else if(score >= 150){
  print("almost failed")
} else {
  print("failed")
}

[1] "almost failed"

In [56]:
#for loop

nums = c(25, 30, 40, 100, 1225)

for (i in nums) {
 if(i %%2 == 0){
  print(paste0(i, " is even"))
 } else {
  print("odd")
 }
}

[1] "odd"
[1] "30 is even"
[1] "40 is even"
[1] "100 is even"
[1] "odd"

In [57]:
# while loop

count = 0

while(count<5){
  print("Woo")
  count=count+1
}

[1] "Woo"
[1] "Woo"
[1] "Woo"
[1] "Woo"
[1] "Woo"

In [59]:
## Take input from a user -> input = character.

name = readline(" What is your name?: ")
greeting_name(name)

 What is your name?: x
[1] "Hello x"

In [60]:
# login logic

users = c("Joe","John","Mary")

loggging_in = function() {
  print("WELCOME")
  username=readline("Username : ")
  password=readline("Password : ")
  if((username %in% users) & (password =="1234")){
    print("logged in successfully")
  }
  else {
    print("you scam!!")
  }
}

In [61]:
loggging_in()

Username : x
Password : 1234
[1] "WELCOME"
[1] "you scam!!"

In [62]:
loggging_in()

Username : Joe
Password : 1234
[1] "WELCOME"
[1] "logged in successfully"

In [63]:
## install libraries

install.packages("tidyverse")
install.packages("RSQLite")
install.packages("readxl")
install.packages("jsonlite")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

also installing the dependency ‘plogr’


Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [65]:
## load libraries

library(tidyverse)
library(glue)
library(RSQLite)
library(readxl)
library(jsonlite)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.5.1     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

Attaching package: ‘jsonlite’


The following object is masked from ‘package:purrr’:

    flatten

In [66]:
# glue => string template

name = "Joe"
age = 55
glue("Hello, my name is {name}, I am {age} years old")
paste0("Hello, my name is ", name, ", I am ", age, " years old") #much longer

Hello, my name is Joe, I am 55 years old

[1] "Hello, my name is Joe, I am 55 years old"

In [67]:
# check path

getwd()

[1] "/content"

In [68]:
## Connect sqlite database

con = dbConnect(SQLite(),"chinook.db")

In [69]:
# check all tables

dbListTables(con)

 [1] "albums"          "artists"         "customers"       "employees"
 [5] "genres"          "invoice_items"   "invoices"        "media_types"
 [9] "playlist_track"  "playlists"       "sqlite_sequence" "sqlite_stat1"
[13] "tracks"

In [70]:
# check column names in a table

dbListFields(con,"customers")

 [1] "CustomerId"   "FirstName"    "LastName"     "Company"      "Address"
 [6] "City"         "State"        "Country"      "PostalCode"   "Phone"
[11] "Fax"          "Email"        "SupportRepId"

In [71]:
# query data from a table

usa_customers = dbGetQuery(con,"
                  SELECT
                    firstname,
                    lastname,
                    country
                  FROM customers
                  WHERE country = 'USA'
                  ")

In [72]:
usa_customers

   FirstName LastName   Country
1  Frank     Harris     USA
2  Jack      Smith      USA
3  Michelle  Brooks     USA
4  Tim       Goyer      USA
5  Dan       Miller     USA
6  Kathy     Chase      USA
7  Heather   Leacock    USA
8  John      Gordon     USA
9  Frank     Ralston    USA
10 Victor    Stevens    USA
11 Richard   Cunningham USA
12 Patrick   Gray       USA
13 Julia     Barnett    USA

In [74]:
## Write a new table into a database

branches = data.frame(
  branch_id = 1:3,
  branch_name = c("Bangkok", "London", "Tokyo")
)

dbWriteTable(con,"branches",branches)

In [75]:
dbListTables(con)

 [1] "albums"          "artists"         "branches"        "customers"
 [5] "employees"       "genres"          "invoice_items"   "invoices"
 [9] "media_types"     "playlist_track"  "playlists"       "sqlite_sequence"
[13] "sqlite_stat1"    "tracks"

In [76]:
dbGetQuery(con,"SELECT branch_name FROM branches")

  branch_name
1 Bangkok
2 London
3 Tokyo

In [77]:
## Remove table

dbRemoveTable(con,"branches")

In [78]:
## Disconnect to avoid corrupted database

dbDisconnect(con)

In [80]:
## Create a new database
# school.db does not exist beforehand

con = dbConnect(SQLite(),"school.db")

students = data.frame(
  student_id=1:3,
  student_name=c("a","b","c")
)

dbWriteTable(con,"students",students)

In [81]:
dbListTables(con)

[1] "students"

In [82]:
dbListFields(con,"students")

[1] "student_id"   "student_name"

In [83]:
## Read files

# read csv file

df1 = read_csv("https://raw.githubusercontent.com/toyeiei/data-traninig/main/student_01.csv")

Rows: 5 Columns: 4
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (2): name, major
dbl (2): id, age

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [84]:
# read csv file using ; as a delimiter

df2 = read_csv2("https://raw.githubusercontent.com/toyeiei/data-traninig/main/student_02.csv")

ℹ Using "','" as decimal and "'.'" as grouping mark. Use `read_delim()` for more control.

Rows: 5 Columns: 4
── Column specification ────────────────────────────────────────────────────────
Delimiter: ";"
chr (2): name, major
dbl (2): id, age

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [86]:
# read txt file using "|" as a delimiter

df3 = read_delim("https://raw.githubusercontent.com/toyeiei/data-traninig/main/student_03.txt", delim="|")

Rows: 5 Columns: 4
── Column specification ────────────────────────────────────────────────────────
Delimiter: "|"
chr (2): name, major
dbl (2): id, age

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [87]:
# read tsv file (tab separated values)

df4 = read_tsv("https://raw.githubusercontent.com/toyeiei/data-traninig/main/student_04.tsv")

Rows: 5 Columns: 4
── Column specification ────────────────────────────────────────────────────────
Delimiter: "\t"
chr (2): name, major
dbl (2): id, age

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [89]:
# read excel file (Sheet name = Sheet1)

df5 = read_excel("student_05.xlsx",sheet="Sheet1")

In [91]:
## Check files with a specified pattern

list.files(pattern="*.json")

[1] "profile.json"  "profile2.json"

In [92]:
# read a json file into R

profile = fromJSON("profile.json")

In [94]:
profile
profile$age

$name
[1] "Toy"

$age
[1] 550

$movie_lover
[1] TRUE

$movies
[1] "Minions"         "Wreck it Ralph!" "Peter Pan"

[1] 550

In [95]:
# read a json file as a data frame

profile2 = fromJSON("profile2.json")

In [96]:
profile2

  name age
1 toy    55
2 john  550
3 mary 5500

In [97]:
## Data Transformation

# data() to see available data

# see example of data
head(mtcars, 3)
tail(mtcars, 3)

              mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4     21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag 21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
Datsun 710    22.8 4   108   93 3.85 2.320 18.61 1  1  4    1

              mpg  cyl disp hp  drat wt   qsec vs am gear carb
Ferrari Dino  19.7 6   145  175 3.62 2.77 15.5 0  1  5    6
Maserati Bora 15.0 8   301  335 3.54 3.57 14.6 0  1  5    8
Volvo 142E    21.4 4   121  109 4.11 2.78 18.6 1  1  4    2

In [98]:
# check column / row names
colnames(mtcars)
rownames(mtcars)

 [1] "mpg"  "cyl"  "disp" "hp"   "drat" "wt"   "qsec" "vs"   "am"   "gear"
[11] "carb"

 [1] "Mazda RX4"           "Mazda RX4 Wag"       "Datsun 710"
 [4] "Hornet 4 Drive"      "Hornet Sportabout"   "Valiant"
 [7] "Duster 360"          "Merc 240D"           "Merc 230"
[10] "Merc 280"            "Merc 280C"           "Merc 450SE"
[13] "Merc 450SL"          "Merc 450SLC"         "Cadillac Fleetwood"
[16] "Lincoln Continental" "Chrysler Imperial"   "Fiat 128"
[19] "Honda Civic"         "Toyota Corolla"      "Toyota Corona"
[22] "Dodge Challenger"    "AMC Javelin"         "Camaro Z28"
[25] "Pontiac Firebird"    "Fiat X1-9"           "Porsche 914-2"
[28] "Lotus Europa"        "Ford Pantera L"      "Ferrari Dino"
[31] "Maserati Bora"       "Volvo 142E"

In [101]:
car_names = rownames(mtcars)

# create a new column - rightest column

mtcars$model = car_names

In [102]:
# delete column values

rownames(mtcars) = NULL

In [105]:
# select columns by column name

select(mtcars, hp, wt, am)

   hp  wt    am
1  110 2.620 1
2  110 2.875 1
3   93 2.320 1
4  110 3.215 0
5  175 3.440 0
6  105 3.460 0
7  245 3.570 0
8   62 3.190 0
9   95 3.150 0
10 123 3.440 0
11 123 3.440 0
12 180 4.070 0
13 180 3.730 0
14 180 3.780 0
15 205 5.250 0
16 215 5.424 0
17 230 5.345 0
18  66 2.200 1
19  52 1.615 1
20  65 1.835 1
21  97 2.465 0
22 150 3.520 0
23 150 3.435 0
24 245 3.840 0
25 175 3.845 0
26  66 1.935 1
27  91 2.140 1
28 113 1.513 1
29 264 3.170 1
30 175 2.770 1
31 335 3.570 1
32 109 2.780 1

In [106]:
# select columns by column number

select(mtcars, 1:5,12)

   mpg  cyl disp  hp  drat model
1  21.0 6   160.0 110 3.90 Mazda RX4
2  21.0 6   160.0 110 3.90 Mazda RX4 Wag
3  22.8 4   108.0  93 3.85 Datsun 710
4  21.4 6   258.0 110 3.08 Hornet 4 Drive
5  18.7 8   360.0 175 3.15 Hornet Sportabout
6  18.1 6   225.0 105 2.76 Valiant
7  14.3 8   360.0 245 3.21 Duster 360
8  24.4 4   146.7  62 3.69 Merc 240D
9  22.8 4   140.8  95 3.92 Merc 230
10 19.2 6   167.6 123 3.92 Merc 280
11 17.8 6   167.6 123 3.92 Merc 280C
12 16.4 8   275.8 180 3.07 Merc 450SE
13 17.3 8   275.8 180 3.07 Merc 450SL
14 15.2 8   275.8 180 3.07 Merc 450SLC
15 10.4 8   472.0 205 2.93 Cadillac Fleetwood
16 10.4 8   460.0 215 3.00 Lincoln Continental
17 14.7 8   440.0 230 3.23 Chrysler Imperial
18 32.4 4    78.7  66 4.08 Fiat 128
19 30.4 4    75.7  52 4.93 Honda Civic
20 33.9 4    71.1  65 4.22 Toyota Corolla
21 21.5 4   120.1  97 3.70 Toyota Corona
22 15.5 8   318.0 150 2.76 Dodge Challenger
23 15.2 8   304.0 150 3.15 AMC Javelin
24 13.3 8   350.0 245 3.73 Camaro Z28
25 19.2 8   400.0 175 3.08 Pontiac Firebird
26 27.3 4    79.0  66 4.08 Fiat X1-9
27 26.0 4   120.3  91 4.43 Porsche 914-2
28 30.4 4    95.1 113 3.77 Lotus Europa
29 15.8 8   351.0 264 4.22 Ford Pantera L
30 19.7 6   145.0 175 3.62 Ferrari Dino
31 15.0 8   301.0 335 3.54 Maserati Bora
32 21.4 4   121.0 109 4.11 Volvo 142E

In [107]:
# select columns by column name and number

select(mtcars, hp, model, 5)

   hp  model               drat
1  110 Mazda RX4           3.90
2  110 Mazda RX4 Wag       3.90
3   93 Datsun 710          3.85
4  110 Hornet 4 Drive      3.08
5  175 Hornet Sportabout   3.15
6  105 Valiant             2.76
7  245 Duster 360          3.21
8   62 Merc 240D           3.69
9   95 Merc 230            3.92
10 123 Merc 280            3.92
11 123 Merc 280C           3.92
12 180 Merc 450SE          3.07
13 180 Merc 450SL          3.07
14 180 Merc 450SLC         3.07
15 205 Cadillac Fleetwood  2.93
16 215 Lincoln Continental 3.00
17 230 Chrysler Imperial   3.23
18  66 Fiat 128            4.08
19  52 Honda Civic         4.93
20  65 Toyota Corolla      4.22
21  97 Toyota Corona       3.70
22 150 Dodge Challenger    2.76
23 150 AMC Javelin         3.15
24 245 Camaro Z28          3.73
25 175 Pontiac Firebird    3.08
26  66 Fiat X1-9           4.08
27  91 Porsche 914-2       4.43
28 113 Lotus Europa        3.77
29 264 Ford Pantera L      4.22
30 175 Ferrari Dino        3.62
31 335 Maserati Bora       3.54
32 109 Volvo 142E          4.11

In [108]:
# select columns by conditions

select(mtcars,contains("z"))

   mpg  am model
1  21.0 1  Mazda RX4
2  21.0 1  Mazda RX4 Wag
3  22.8 1  Datsun 710
4  21.4 0  Hornet 4 Drive
5  18.7 0  Hornet Sportabout
6  18.1 0  Valiant
7  14.3 0  Duster 360
8  24.4 0  Merc 240D
9  22.8 0  Merc 230
10 19.2 0  Merc 280
11 17.8 0  Merc 280C
12 16.4 0  Merc 450SE
13 17.3 0  Merc 450SL
14 15.2 0  Merc 450SLC
15 10.4 0  Cadillac Fleetwood
16 10.4 0  Lincoln Continental
17 14.7 0  Chrysler Imperial
18 32.4 1  Fiat 128
19 30.4 1  Honda Civic
20 33.9 1  Toyota Corolla
21 21.5 0  Toyota Corona
22 15.5 0  Dodge Challenger
23 15.2 0  AMC Javelin
24 13.3 0  Camaro Z28
25 19.2 0  Pontiac Firebird
26 27.3 1  Fiat X1-9
27 26.0 1  Porsche 914-2
28 30.4 1  Lotus Europa
29 15.8 1  Ford Pantera L
30 19.7 1  Ferrari Dino
31 15.0 1  Maserati Bora
32 21.4 1  Volvo 142E

In [109]:
## Data Transformation Pipeline
# using %>% or |> to create a pipeline

## data transformation pipeline
# data %>%
#     select() %>%
#     filter() %>%
#     arrange() %>%
#     mutate() %>%
#     summarise() %>%

mtcars %>%
  select(model, hp) %>%
  filter(hp>200)

  model               hp
1 Duster 360          245
2 Cadillac Fleetwood  205
3 Lincoln Continental 215
4 Chrysler Imperial   230
5 Camaro Z28          245
6 Ford Pantera L      264
7 Maserati Bora       335

In [110]:
mtcars %>%
  select(model, hp, wt, am) |>
  filter((hp>=200 & wt < 5) | (am = 0))

  model          hp  wt   am
1 Duster 360     245 3.57 0
2 Camaro Z28     245 3.84 0
3 Ford Pantera L 264 3.17 1
4 Maserati Bora  335 3.57 1

In [111]:
mtcars %>%
  select(model, hp, wt, am) |>
  filter(between(hp, 100, 123))

  model          hp  wt    am
1 Mazda RX4      110 2.620 1
2 Mazda RX4 Wag  110 2.875 1
3 Hornet 4 Drive 110 3.215 0
4 Valiant        105 3.460 0
5 Merc 280       123 3.440 0
6 Merc 280C      123 3.440 0
7 Lotus Europa   113 1.513 1
8 Volvo 142E     109 2.780 1

In [112]:
mtcars %>%
  select(model, hp, wt, am) |>
  filter(grepl("^M", model)) |>
  arrange(am ,desc(hp))

   model         hp  wt    am
1  Merc 450SE    180 4.070 0
2  Merc 450SL    180 3.730 0
3  Merc 450SLC   180 3.780 0
4  Merc 280      123 3.440 0
5  Merc 280C     123 3.440 0
6  Merc 230       95 3.150 0
7  Merc 240D      62 3.190 0
8  Maserati Bora 335 3.570 1
9  Mazda RX4     110 2.620 1
10 Mazda RX4 Wag 110 2.875 1

In [113]:
# mutate

mtcars |>
  filter(hp > 200) |>
  select(model,am,hp) |>
  mutate(am_label = ifelse(am ==0, "Auto", "Manual"),
        hp_double = hp*2)

  model               am hp  am_label hp_double
1 Duster 360          0  245 Auto     490
2 Cadillac Fleetwood  0  205 Auto     410
3 Lincoln Continental 0  215 Auto     430
4 Chrysler Imperial   0  230 Auto     460
5 Camaro Z28          0  245 Auto     490
6 Ford Pantera L      1  264 Manual   528
7 Maserati Bora       1  335 Manual   670

In [114]:
# summarise => SQL aggregate function

mtcars |>
  summarise(mean_hp = mean(hp),
            sum_hp = sum(hp),
            median_hp = median(hp),
            sd_hp= sd(hp),
            n = n())

  mean_hp  sum_hp median_hp sd_hp    n
1 146.6875 4694   123       68.56287 32